# معرض المنتجات (باقي شرط ال current stock فقط)
# تقرير المنتجات(باقي شرط ال current stock فقط)
# التحويلات المخزنيه(يبقي التأثير المحاسبي فقط والطباعه)
السندات علي عرض ال PaymentController(تاكد من الطباعه واضافه حقل ال اي دي الي الجدول حق الميجريشن و تاكد من الواجهه هل هي صحيحه)
# السايدبار(باقي الترتيب فقط)

عند تسجيل الدخول  خليه يذهب الي شاشه الاشتراكات كما في النظام الاصلي

#  عمليات المورد(حساب  -تقريبا كل العمليات علي المورد الذي لايحتوي غمليات) 
#  عمليات العميل(حساب - تقريبا كل العمليات علي العمبل الذي لايحتوي غمليات)
عمليات المنتجات (عمليه الفحص وعمليات اخري اصلج مشكله تكرار المخازن )
# ( حق التعديل فقط باقي الحفظ للداتابيز) عمليات المخازن
كيف يتم ال superadmin
منع عمليه seed للمستخدم عند انشاء مستأجر
متي يتم تهيه  package table  
تعديل واجهه  مستأجر وكذلك المستخدم 

ربط الحساب في الفواتير المحصله
# عرض التأريخ والاشعارات وعلامه التعجب بلوحه تحكم المستأجرين


اختبار التاثير علي جداول contact,transaction_payment,account_transactionعند عمل عمليه شراء او بيع او العمليات الاخري   

في المخزون التالف عند اضافه تالف والمخزون صفر يقوم بالانقاص الي سالب واحد رغم ان هذه المشكله ليست موجوده في النظام الاصلي حيث ان المنتج الذي كميته صفر لايطهره البرنامج تاكد من الاستعلام 

# تقرير المخزون التالف ضبط طود المخزن والموقع في الباكند  getStockAdjustmentReport

# تقرير انتهاء صلاحيه المخزون getStockExpiryReport(report controller)


ضبط  نقطه البيع (انهاء جلسه نقطه البيع وتفاصيل الورديه حل المشكله  و بيان سعر وفي قايمه نقاط البيع التعدبل وتعدبل الشحن ومبيعات مكرره واضافه المخزن الي قايمه نقاط البيع  وارجاع بيانات عند اختيار فرع بدون مخزن Undefined array key 0 )

اضافه اسم العمله بجانب الرقم 

بعض البيانات لم تترجم بينما بالنظام الاصلي مترجمه

تخلص من  السايدبار report 606,report 607,تقرير انتهاء صلاحيه المخزون,وتقرير المخزن 

# التأكد من مخرجات تقرير العناصر لانه يرجع مورد واحد فقط

# واجهه المصاريق ربما فيها مشاكل افحصها

كشف حساب في واجهه الحسابات العامه فيه حاجات مهمه استكشفه

تغير ظهور المنتج بتغير الفلتره حق ال store,location,search_product
اضافه جدول ال kitchens
حل مشكله عند تكرار ادخال  رثم المنتج في خانه البحث في المشتريات يضيف صف اخر لكن في المبيعات يزيد القيمه قارنه مع النظام السابق وكذلك عند تبديل المخزن او الموقع هل يجي غمل تنظيف للمنتجات  وحقل البحث تاكد هل توكد هذه الميزه في النظام السابق

تقرير الربح الخسارة   تأكد من openning_stock_by_spوclosing_stock_by_sp تأكد من النظام 8.1.9 php في هذه النسخه انا علقتها فقط

# ------------------------------------------------------
# اضافه اصل والاهلاكات 
